<?php

return [

    "name" => [
        "required" => "حقل الاسم مطلوب.",
        "string" => "يجب أن يكون الاسم نصًا صحيحًا.",
        "min" => "يجب ألا يقل الاسم عن :min أحرف.",
        "max" => "يجب ألا يزيد الاسم عن :max حرف.",
    ],

    "email" => [
        "required" => "البريد الإلكتروني مطلوب.",
        "email" => "يرجى إدخال بريد إلكتروني صحيح.",
        "unique" => "هذا البريد الإلكتروني مستخدم بالفعل.",
    ],

    "phone" => [
        "required" => "رقم الهاتف مطلوب.",
        "digits_between" => "يجب أن يكون رقم الهاتف بين :min و :max رقم.",
        "unique" => "رقم الهاتف مستخدم بالفعل.",
    ],

    "password" => [
        "required" => "كلمة المرور مطلوبة.",
        "string" => "يجب أن تكون كلمة المرور نصًا.",
        "min" => "يجب ألا تقل كلمة المرور عن :min أحرف.",
        "max" => "يجب ألا تزيد كلمة المرور عن :max حرف.",
        "confirmed" => "تأكيد كلمة المرور غير متطابق.",
    ],

    "login" => [
        "required" => "يجب ادخال حقل الايميل او رقم الهاتف لتتمكن من تسجيل الدخول",
    ]

];
